-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 10, 2025 at 07:49 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `blrr_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `chairmanfile`
--

CREATE TABLE `chairmanfile` (
  `id` int(11) NOT NULL,
  `unique_id` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `entry_date` date NOT NULL,
  `recipient` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `immediate_sender_office` varchar(100) NOT NULL,
  `section_dept` varchar(100) NOT NULL,
  `d_number` int(11) NOT NULL,
  `attention` varchar(255) NOT NULL,
  `ref_number` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `sign_date` date NOT NULL,
  `sender` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `div_dept_office` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `subject` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `destination` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `destination_dropfile` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `distribution_date` date NOT NULL,
  `chairman_note` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `comments` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `medium` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `div_sign_date` date NOT NULL,
  `time` datetime NOT NULL,
  `modified_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `chairmanfile`
--

INSERT INTO `chairmanfile` (`id`, `unique_id`, `entry_date`, `recipient`, `immediate_sender_office`, `section_dept`, `d_number`, `attention`, `ref_number`, `sign_date`, `sender`, `div_dept_office`, `subject`, `destination`, `destination_dropfile`, `distribution_date`, `chairman_note`, `comments`, `medium`, `div_sign_date`, `time`, `modified_at`, `created_at`) VALUES
(1, '', '2025-10-01', 'হিসাব নিয়ন্ত্রক', '', '', 1, '', '', '2025-10-02', '', '', 'test1', '', 'চেয়ারম্যান', '0000-00-00', '', 'jgh\'r', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 05:39:47', '2025-10-12 05:39:47'),
(2, '', '2025-10-01', 'কর্মচারী প্রধান', '', '', 2, '', '', '2025-10-02', '', '', 'test 2', '', 'চেয়ারম্যান', '0000-00-00', '', 'jgh\'r', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 05:40:18', '2025-10-12 05:40:18'),
(3, '', '2025-10-03', 'ক্রয় বিভাগ', '', '', 3, '', '', '2025-10-10', '', '', 'test1', '', 'চেয়ারম্যান', '0000-00-00', '', 'jgh\\\'r', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 05:50:11', '2025-10-12 05:50:11'),
(4, '', '2025-10-02', 'পরিচালক (বাণিজ্যিক)', '', '', 4, '', '', '2025-10-04', '', '', 'ICTD', '', 'চেয়ারম্যান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 05:50:45', '2025-10-12 05:50:45'),
(5, '', '2025-10-04', 'এমআইএস বিভাগ', '', '', 4, '', '', '2025-10-08', '', '', 'd', '', 'চেয়ারম্যান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 05:51:15', '2025-10-12 05:51:15'),
(6, '', '2025-10-02', 'পিএস', '', '', 5, '', '', '2025-10-18', '', '', 'test1', '', 'চেয়ারম্যান', '0000-00-00', '', 'hjj\'g', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 05:51:48', '2025-10-12 05:51:48'),
(7, '', '2025-09-30', 'জনসংযোগ বিভাগ', '', '', 5, '', '', '2025-10-09', '', '', 'ICTD', '', 'চেয়ারম্যান', '0000-00-00', '', 'hjj\'g', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 05:52:01', '2025-10-12 05:52:01'),
(8, '', '2025-10-01', 'ক্রয় বিভাগ', '', '', 6, '', '', '2025-10-07', '', '', 'মতবিনিময় সভা', '', 'চেয়ারম্যান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 05:57:26', '2025-10-12 05:57:26'),
(9, '', '2025-10-01', 'পিএস', '', '', 7, '', '', '2025-10-02', '', '', 'test 2', '', 'চেয়ারম্যান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 06:11:35', '2025-10-12 06:11:35'),
(10, '', '2025-10-02', 'ক্রয় বিভাগ', '', '', 8, '', '', '2025-10-11', '', '', 'sdfsdfs', '', 'চেয়ারম্যান', '0000-00-00', '', 'jgh\'r', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 06:13:41', '2025-10-12 06:13:41'),
(11, '', '2025-10-02', 'ক্রয় বিভাগ', '', '', 9, '', '', '2025-10-11', '', '', 'dfasd', '', 'চেয়ারম্যান', '0000-00-00', '', 'dfs', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 06:15:11', '2025-10-12 06:15:11'),
(12, '', '2025-10-02', 'এমটিএস বিভাগ', '', '', 10, '', '', '2025-10-18', '', '', 'SFCL', '', 'চেয়ারম্যান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 06:16:31', '2025-10-12 06:16:31'),
(13, '', '2025-10-01', 'ক্রয় বিভাগ', '', '', 11, '', '', '2025-10-11', '', '', 'ICTD', '', 'চেয়ারম্যান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 07:03:47', '2025-10-12 07:03:47'),
(14, '', '2025-10-01', 'ক্রয় বিভাগ', '', '', 12, '', '', '2025-10-08', '', '', 'fdsfs', '', 'চেয়ারম্যান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 07:06:40', '2025-10-12 07:06:40'),
(15, '', '2025-09-30', 'পরিচালক (বাণিজ্যিক)', '', '', 13, '', '', '2025-10-09', '', '', 'sfs', '', 'চেয়ারম্যান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 07:09:16', '2025-10-12 07:09:16'),
(16, '', '2025-10-01', 'চেয়ারম্যান', '', '', 14, '', '', '2025-10-04', '', '', 'sdfs', '', 'চেয়ারম্যান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 07:10:30', '2025-10-12 07:10:30'),
(17, '', '2025-10-01', 'পরিচালক (বাণিজ্যিক)', '', '', 15, '', '', '2025-10-04', '', '', 'sdf', '', 'চেয়ারম্যান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 07:11:18', '2025-10-12 07:11:18'),
(18, '', '2025-10-01', 'পরিচালক (উৎপাদন ও গবেষণা)', '', '', 16, '', '', '2025-10-02', '', '', 'sgdfsd', '', 'চেয়ারম্যান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 07:13:22', '2025-10-12 07:13:22'),
(19, '', '2025-10-03', 'পিএস', '', '', 17, '', '', '2025-10-02', '', '', 'dfg', '', 'চেয়ারম্যান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 07:15:06', '2025-10-12 07:15:06'),
(20, '', '2025-10-02', 'পরিচালক (অর্থ)', '', '', 18, '', '', '2025-10-03', '', '', 'test1', '', 'চেয়ারম্যান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 07:19:56', '2025-10-12 07:19:56'),
(21, '', '2025-10-01', 'এমআইএস বিভাগ', '', '', 21, '', '', '2025-10-15', '', '', 'sffgf dedd', '', 'চেয়ারম্যান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 07:39:54', '2025-10-12 07:22:53'),
(22, '', '2025-10-01', 'ক্রয় বিভাগ', '', '', 20, '', '', '2025-10-09', '', '', 'test1', '', 'চেয়ারম্যান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 07:33:20', '2025-10-12 07:33:20'),
(23, '', '2025-10-02', 'ঊর্ধ্বতন মহাব্যবস্থাপক (প্রশাসন)', '', '', 22, '', '', '2025-10-01', '', '', 'sdfsdf', '', 'পিএস', '0000-00-00', '', 'ds', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-12 07:56:16', '2025-10-12 07:40:06'),
(24, '', '2025-10-23', 'পরিচালক (বাণিজ্যিক)', '', '', 23, '', '', '2025-10-22', '', '', 'test 123fgd', '', 'পরিচালক (বাণিজ্যিক),পরিচালক (অর্থ)', '0000-00-00', '', 'fhfhgfhfg', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-23 06:27:45', '2025-10-23 06:27:15'),
(25, '', '2025-10-23', 'হিসাব নিয়ন্ত্রক', '', '', 24, '', '', '2025-10-24', '', '', 'hdfgdfg', '', 'পরিচালক (অর্থ)', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-23 06:28:47', '2025-10-23 06:28:47'),
(26, '', '2025-10-23', 'সাধারণ কর্মশাখা', '', '', 25, '', '', '2025-10-23', '', '', 'সংস্থার কার নং-১২-৮১১৬ মেরামত সংক্রান্ত।', '', 'চেয়ারম্যান,পরিচালক (বাণিজ্যিক)', '0000-00-00', '', 'আলোচনা করুন।', '', '0000-00-00', '0000-00-00 00:00:00', '2025-10-23 07:57:18', '2025-10-23 07:56:32'),
(27, '', '2025-10-23', 'চেয়ারম্যান', 'হিসাব নিয়ন্ত্রক', '', 26, '', '', '2025-10-24', '', '', 'াাাাাাাা', '', 'পরিচালক (পরিকল্পনা ও বাস্তবায়ন)', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-11-03 08:17:06', '2025-10-23 08:00:26'),
(29, '', '2025-11-03', '0', 'হিসাব নিয়ন্ত্রক', 'test', 27, '', '', '2025-11-03', '', '', 'fsf', '', 'পরিচালক (অর্থ)', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-11-03 08:00:18', '2025-11-03 08:00:18'),
(30, '', '2025-11-03', 'চেয়ারম্যান', 'কর্মচারী প্রধান', 'RNT', 28, '', '', '2025-11-03', '', '', 'RNT', '', 'কর্মচারী প্রধান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-11-03 08:16:59', '2025-11-03 08:02:31'),
(31, '', '2025-11-03', 'চেয়ারম্যান', 'পিএস', 'testbnmmbn', 29, '', '', '2025-11-03', '', '', 'test1', '', 'পরিচালক (বাণিজ্যিক)', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-11-03 08:17:44', '2025-11-03 08:17:29'),
(32, '', '2026-01-22', 'চেয়ারম্যান', 'কর্মচারী প্রধান', 'RNT', 1, '', '', '2025-11-03', '', '', 'ICTD', '', 'পরিচালক (অর্থ)', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-11-03 08:23:33', '2025-11-03 08:23:33'),
(33, '', '2026-01-22', 'চেয়ারম্যান', 'পরিচালক (অর্থ)', 'sdfs', 2, '', '', '2025-11-03', '', '', 'sdfs', '', 'পরিচালক (অর্থ)', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-11-03 08:24:14', '2025-11-03 08:24:14'),
(34, '', '2025-11-03', 'চেয়ারম্যান', 'পরিচালক (অর্থ)', 'sdf', 30, '', '', '2025-11-03', '', '', 'fsd', '', 'পরিচালক (অর্থ)', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-11-03 08:24:34', '2025-11-03 08:24:34'),
(35, '', '2025-11-04', 'চেয়ারম্যান', 'কর্মচারী প্রধান', 'প্রশাসন-২', 31, '', '', '2025-11-04', '', '', 'বিভিন্ন কমিটিতে কর্মকর্তা মনোনয়ন।', '', 'কর্মচারী প্রধান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-11-04 04:02:55', '2025-11-04 04:02:55'),
(36, '', '2025-11-04', 'চেয়ারম্যান', 'ক্রয় বিভাগ', 'প্রশাসন-৩', 32, '', '', '2025-11-05', '', '', 'জনাব মো: ইমরান হোসেন, সহকারী রসায়নবিদ এর বিরদ্ধে বিভাগীয় মামলা রুজুকরণ।', '', 'পরিচালক (বাণিজ্যিক)', '0000-00-00', '', '', '', '2025-11-04', '0000-00-00 00:00:00', '2025-11-04 06:53:20', '2025-11-04 04:06:42'),
(37, '', '2025-11-06', 'চেয়ারম্যান', 'পরিচালক (পরিকল্পনা ও বাস্তবায়ন)', 'প্রকল্প বাস্তবায়ন বিভাগ', 33, '', '', '2025-11-06', '', '', '২০২৫ অর্থ বছরের সংশোধিত বাজেট প্রক্কলন।', '', 'পরিচালক (অর্থ)', '0000-00-00', '', '', '', '2025-11-06', '0000-00-00 00:00:00', '2025-11-06 03:29:20', '2025-11-06 03:29:20'),
(38, '', '2026-01-07', 'চেয়ারম্যান', 'পরিচালক (বাণিজ্যিক)', 'LOCAL', 3, '', '', '2025-11-09', '', 'ক্রয় বিভাগ', 'test1', '', 'হিসাব নিয়ন্ত্রক', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-11-09 04:16:17', '2025-11-09 04:16:17'),
(39, '', '2025-11-09', 'চেয়ারম্যান', 'পরিচালক (বাণিজ্যিক)', 'LOCAL', 34, '', '', '2025-11-09', '', 'ক্রয় বিভাগ', 'মতবিনিময় সভা', '', 'কর্মচারী প্রধান', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-11-09 04:18:07', '2025-11-09 04:18:07'),
(40, '', '2025-11-09', 'চেয়ারম্যান', 'পরিচালক (বাণিজ্যিক)', 'Electrical', 35, '', '', '2025-11-09', '', 'এমআইএস বিভাগ', 'meeeee', '', 'পরিচালক (অর্থ)', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-11-09 04:40:45', '2025-11-09 04:40:45'),
(41, '', '2025-11-09', 'চেয়ারম্যান', 'পরিচালক (বাণিজ্যিক)', 'ক্রয়', 36, '', '', '2025-11-09', '', 'হিসাব নিয়ন্ত্রক', 'সার ghgfh', '', 'পরিচালক (বাণিজ্যিক)', '0000-00-00', '', '', '', '0000-00-00', '0000-00-00 00:00:00', '2025-11-09 06:43:01', '2025-11-09 06:31:53'),
(42, '', '2025-11-09', 'চেয়ারম্যান', 'পরিচালক (বাণিজ্যিক)', 'প্রশাসন-২', 37, '', '', '2025-11-09', '', '', 'সিলেকশন কমিটি-ে২ (এসএসসি-২) এ শিল্প মন্ত্রণালয়ের প্রতিনিধি মনোনয়্ন', '', 'পরিচালক (বাণিজ্যিক)', '0000-00-00', '', 'আলোচনা করুন।', '', '2025-11-09', '0000-00-00 00:00:00', '2025-11-09 08:40:25', '2025-11-09 08:40:25');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `chairmanfile`
--
ALTER TABLE `chairmanfile`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `chairmanfile`
--
ALTER TABLE `chairmanfile`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
